# CannotCreateOpenMiddleStringers Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..CannotCreateOpenMiddleStringers Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Can't cut open/middle stringers geometry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateOpenMiddleStringers { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateOpenMiddleStringers As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateOpenMiddleStringers {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace